Autodesk.Revit.DB.BuildingPadType.CreateDefault(Autodesk.Revit.DB.Document)
Creates a BuildingPadType element and adds it to the document.
Remarks:
The default BuildiPadType adopts the value of 1.0 for the paremeter of thickness.
If there is no BuildingPadType existing, will create a new one; otherwise, an exception will be thrown.
document:
The document to be modified.
Returns:
The new BuildingPadType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.